###############################################################
#  Generated by:      Cadence Innovus 21.13-s100_1
#  OS:                Linux x86_64(Host ID linux-lab-107.ece.uw.edu)
#  Generated on:      Thu Apr 30 22:57:48 2026
#  Design:            sobel_top
#  Command:           write_sdc /home/josee767/ee478/capstone/sobel_accelerator/build/par-rundir/sobel_top.par.sdc
###############################################################
current_design sobel_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 15.000000 -waveform {0.000000 7.500000}
set_propagated_clock  [get_ports {clk}]
set_load -pin_load -max  0.01  [get_ports {edge_out}]
set_load -pin_load -min  0.01  [get_ports {edge_out}]
set_load -pin_load -max  0.01  [get_ports {valid_edge}]
set_load -pin_load -min  0.01  [get_ports {valid_edge}]
set_load -pin_load -max  0.01  [get_ports {frame_done}]
set_load -pin_load -min  0.01  [get_ports {frame_done}]
set_load -pin_load -max  0.005  [get_ports {debug_col[6]}]
set_load -pin_load -min  0.005  [get_ports {debug_col[6]}]
set_load -pin_load -max  0.005  [get_ports {debug_col[5]}]
set_load -pin_load -min  0.005  [get_ports {debug_col[5]}]
set_load -pin_load -max  0.005  [get_ports {debug_col[4]}]
set_load -pin_load -min  0.005  [get_ports {debug_col[4]}]
set_load -pin_load -max  0.005  [get_ports {debug_col[3]}]
set_load -pin_load -min  0.005  [get_ports {debug_col[3]}]
set_load -pin_load -max  0.005  [get_ports {debug_col[2]}]
set_load -pin_load -min  0.005  [get_ports {debug_col[2]}]
set_load -pin_load -max  0.005  [get_ports {debug_col[1]}]
set_load -pin_load -min  0.005  [get_ports {debug_col[1]}]
set_load -pin_load -max  0.005  [get_ports {debug_col[0]}]
set_load -pin_load -min  0.005  [get_ports {debug_col[0]}]
set_load -pin_load -max  0.005  [get_ports {debug_row[6]}]
set_load -pin_load -min  0.005  [get_ports {debug_row[6]}]
set_load -pin_load -max  0.005  [get_ports {debug_row[5]}]
set_load -pin_load -min  0.005  [get_ports {debug_row[5]}]
set_load -pin_load -max  0.005  [get_ports {debug_row[4]}]
set_load -pin_load -min  0.005  [get_ports {debug_row[4]}]
set_load -pin_load -max  0.005  [get_ports {debug_row[3]}]
set_load -pin_load -min  0.005  [get_ports {debug_row[3]}]
set_load -pin_load -max  0.005  [get_ports {debug_row[2]}]
set_load -pin_load -min  0.005  [get_ports {debug_row[2]}]
set_load -pin_load -max  0.005  [get_ports {debug_row[1]}]
set_load -pin_load -min  0.005  [get_ports {debug_row[1]}]
set_load -pin_load -max  0.005  [get_ports {debug_row[0]}]
set_load -pin_load -min  0.005  [get_ports {debug_row[0]}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
set_clock_latency -source -early -min -rise  -0.941281 [get_ports {clk}] -clock clk 
set_clock_latency -source -early -min -fall  -0.890689 [get_ports {clk}] -clock clk 
set_clock_latency -source -early -max -rise  -0.941281 [get_ports {clk}] -clock clk 
set_clock_latency -source -early -max -fall  -0.890689 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -min -rise  -0.941281 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -min -fall  -0.890689 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -max -rise  -0.941281 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -max -fall  -0.890689 [get_ports {clk}] -clock clk 
set_clock_groups -name clock_groups_clk_to_others -asynchronous  -group  [get_clocks {clk}]
